{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "u_encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["input_1", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["add", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "name": "u_encoder", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "f_encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["input_3", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["add_2", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_11", 0, 0]]}, "name": "f_encoder", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "SymmetricOperator", "config": {"name": "symmetric_operator", "trainable": true, "dtype": "float32", "initializer": {"class_name": "Identity", "config": {"gain": 1.0}, "__passive_serialization__": true}}, "name": "symmetric_operator", "inbound_nodes": [[["u_encoder", 1, 0, {}]]]}, {"class_name": "SolveOperatorInverse", "config": {"name": "solve_operator_inverse", "trainable": true, "dtype": "float32", "operator_layer": {"class_name": "SymmetricOperator", "config": {"name": "symmetric_operator", "trainable": true, "dtype": "float32", "initializer": {"class_name": "Identity", "config": {"gain": 1.0}, "__passive_serialization__": true}}, "__passive_serialization__": true}}, "name": "solve_operator_inverse", "inbound_nodes": [[["f_encoder", 1, 0, {}]]]}, {"class_name": "Model", "config": {"name": "u_decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_7", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["add_1", 0, 0]]}, "name": "u_decoder", "inbound_nodes": [[["u_encoder", 1, 0, {}]], [["solve_operator_inverse", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "f_decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["dense_12", 0, 0, {}], ["dense_15", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["add_3", 0, 0]]}, "name": "f_decoder", "inbound_nodes": [[["f_encoder", 1, 0, {}]], [["symmetric_operator", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "sub", "trainable": true, "dtype": "float32", "node_def": {"name": "sub", "op": "Sub", "input": ["symmetric_operator/Identity", "f_encoder/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_sub", "inbound_nodes": [[["symmetric_operator", 0, 0, {}], ["f_encoder", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Square", "trainable": true, "dtype": "float32", "node_def": {"name": "Square", "op": "Square", "input": ["sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Square", "inbound_nodes": [[["tf_op_layer_sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "norm/mul", "op": "Mul", "input": ["Square", "Square"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm/mul", "inbound_nodes": [[["tf_op_layer_Square", 0, 0, {}], ["tf_op_layer_Square", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_1/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_1/mul", "op": "Mul", "input": ["f_encoder/Identity", "f_encoder/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_1/mul", "inbound_nodes": [[["f_encoder", 1, 0, {}], ["f_encoder", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm/Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "norm/Sum", "op": "Sum", "input": ["norm/mul", "norm/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, "constants": {"1": [0, 1]}}, "name": "tf_op_layer_norm/Sum", "inbound_nodes": [[["tf_op_layer_norm/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_1/Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_1/Sum", "op": "Sum", "input": ["norm_1/mul", "norm_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, "constants": {"1": [0, 1]}}, "name": "tf_op_layer_norm_1/Sum", "inbound_nodes": [[["tf_op_layer_norm_1/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm/Sqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "norm/Sqrt", "op": "Sqrt", "input": ["norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm/Sqrt", "inbound_nodes": [[["tf_op_layer_norm/Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_1/Sqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_1/Sqrt", "op": "Sqrt", "input": ["norm_1/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_1/Sqrt", "inbound_nodes": [[["tf_op_layer_norm_1/Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "norm/Squeeze", "op": "Squeeze", "input": ["norm/Sqrt"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm/Squeeze", "inbound_nodes": [[["tf_op_layer_norm/Sqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_1/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_1/Squeeze", "op": "Squeeze", "input": ["norm_1/Sqrt"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_1/Squeeze", "inbound_nodes": [[["tf_op_layer_norm_1/Sqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "truediv", "trainable": true, "dtype": "float32", "node_def": {"name": "truediv", "op": "RealDiv", "input": ["norm/Squeeze", "norm_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_truediv", "inbound_nodes": [[["tf_op_layer_norm/Squeeze", 0, 0, {}], ["tf_op_layer_norm_1/Squeeze", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss/Mul", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss/Mul", "op": "Mul", "input": ["truediv", "weighted_loss/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_weighted_loss/Mul", "inbound_nodes": [[["tf_op_layer_truediv", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss/Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss/Sum", "op": "Sum", "input": ["weighted_loss/Mul", "weighted_loss/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": []}}, "name": "tf_op_layer_weighted_loss/Sum", "inbound_nodes": [[["tf_op_layer_weighted_loss/Mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss/Sum_1", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss/Sum_1", "op": "Sum", "input": ["weighted_loss/Sum", "weighted_loss/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_weighted_loss/Sum_1", "inbound_nodes": [[["tf_op_layer_weighted_loss/Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss/value", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss/value", "op": "DivNoNan", "input": ["weighted_loss/Sum_1", "weighted_loss/num_elements/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_weighted_loss/value", "inbound_nodes": [[["tf_op_layer_weighted_loss/Sum_1", 0, 0, {}]]]}, {"class_name": "AddLoss", "config": {"name": "add_loss", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss", "inbound_nodes": [[["tf_op_layer_weighted_loss/value", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_2", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_2", "op": "StridedSlice", "input": ["symmetric_operator/Identity", "strided_slice_2/begin", "strided_slice_2/end", "strided_slice_2/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, "constants": {"1": [0], "2": [0], "3": [1]}}, "name": "tf_op_layer_strided_slice_2", "inbound_nodes": [[["symmetric_operator", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_3", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_3", "op": "StridedSlice", "input": ["symmetric_operator/Identity", "strided_slice_3/begin", "strided_slice_3/end", "strided_slice_3/strides"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, "constants": {"1": [0, 0], "2": [0, 0], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_3", "inbound_nodes": [[["symmetric_operator", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice", "op": "StridedSlice", "input": ["f_encoder/Identity", "strided_slice/begin", "strided_slice/end", "strided_slice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0], "2": [0], "3": [1]}}, "name": "tf_op_layer_strided_slice", "inbound_nodes": [[["f_encoder", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_1", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_1", "op": "StridedSlice", "input": ["f_encoder/Identity", "strided_slice_1/begin", "strided_slice_1/end", "strided_slice_1/strides"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, "constants": {"1": [0, 0], "2": [0, 0], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_1", "inbound_nodes": [[["f_encoder", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_5", "trainable": true, "dtype": "float32", "node_def": {"name": "add_5", "op": "AddV2", "input": ["strided_slice_2", "strided_slice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_5", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}], ["tf_op_layer_strided_slice_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_4", "trainable": true, "dtype": "float32", "node_def": {"name": "add_4", "op": "AddV2", "input": ["strided_slice", "strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_4", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}], ["tf_op_layer_strided_slice_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_1", "op": "Reshape", "input": ["add_5", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 20]}}, "name": "tf_op_layer_Reshape_1", "inbound_nodes": [[["tf_op_layer_add_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape", "op": "Reshape", "input": ["add_4", "Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1, 20]}}, "name": "tf_op_layer_Reshape", "inbound_nodes": [[["tf_op_layer_add_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "sub_1", "trainable": true, "dtype": "float32", "node_def": {"name": "sub_1", "op": "Sub", "input": ["Reshape_1", "Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_sub_1", "inbound_nodes": [[["tf_op_layer_Reshape_1", 0, 0, {}], ["tf_op_layer_Reshape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Square_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Square_1", "op": "Square", "input": ["sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Square_1", "inbound_nodes": [[["tf_op_layer_sub_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_2/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_2/mul", "op": "Mul", "input": ["Square_1", "Square_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_2/mul", "inbound_nodes": [[["tf_op_layer_Square_1", 0, 0, {}], ["tf_op_layer_Square_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_3/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_3/mul", "op": "Mul", "input": ["Reshape", "Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_3/mul", "inbound_nodes": [[["tf_op_layer_Reshape", 0, 0, {}], ["tf_op_layer_Reshape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_2/Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_2/Sum", "op": "Sum", "input": ["norm_2/mul", "norm_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, "constants": {"1": [0, 1]}}, "name": "tf_op_layer_norm_2/Sum", "inbound_nodes": [[["tf_op_layer_norm_2/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_3/Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_3/Sum", "op": "Sum", "input": ["norm_3/mul", "norm_3/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1]}}, "name": "tf_op_layer_norm_3/Sum", "inbound_nodes": [[["tf_op_layer_norm_3/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_2/Sqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_2/Sqrt", "op": "Sqrt", "input": ["norm_2/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_2/Sqrt", "inbound_nodes": [[["tf_op_layer_norm_2/Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_3/Sqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_3/Sqrt", "op": "Sqrt", "input": ["norm_3/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_3/Sqrt", "inbound_nodes": [[["tf_op_layer_norm_3/Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_2/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_2/Squeeze", "op": "Squeeze", "input": ["norm_2/Sqrt"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_2/Squeeze", "inbound_nodes": [[["tf_op_layer_norm_2/Sqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "norm_3/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "norm_3/Squeeze", "op": "Squeeze", "input": ["norm_3/Sqrt"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_norm_3/Squeeze", "inbound_nodes": [[["tf_op_layer_norm_3/Sqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "truediv_1", "trainable": true, "dtype": "float32", "node_def": {"name": "truediv_1", "op": "RealDiv", "input": ["norm_2/Squeeze", "norm_3/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_truediv_1", "inbound_nodes": [[["tf_op_layer_norm_2/Squeeze", 0, 0, {}], ["tf_op_layer_norm_3/Squeeze", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss_1/Mul", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss_1/Mul", "op": "Mul", "input": ["truediv_1", "weighted_loss_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_weighted_loss_1/Mul", "inbound_nodes": [[["tf_op_layer_truediv_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss_1/Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss_1/Sum", "op": "Sum", "input": ["weighted_loss_1/Mul", "weighted_loss_1/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_weighted_loss_1/Sum", "inbound_nodes": [[["tf_op_layer_weighted_loss_1/Mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss_1/Sum_1", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss_1/Sum_1", "op": "Sum", "input": ["weighted_loss_1/Sum", "weighted_loss_1/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_weighted_loss_1/Sum_1", "inbound_nodes": [[["tf_op_layer_weighted_loss_1/Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "weighted_loss_1/value", "trainable": true, "dtype": "float32", "node_def": {"name": "weighted_loss_1/value", "op": "DivNoNan", "input": ["weighted_loss_1/Sum_1", "weighted_loss_1/num_elements/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_weighted_loss_1/value", "inbound_nodes": [[["tf_op_layer_weighted_loss_1/Sum_1", 0, 0, {}]]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_1", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_1", "inbound_nodes": [[["tf_op_layer_weighted_loss_1/value", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]], "output_layers": [["u_decoder", 1, 0], ["f_decoder", 1, 0], ["f_decoder", 2, 0], ["u_decoder", 2, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}